Tekla Open API Reference for Tekla Structures 2025
ModelObjectEnumerator.Current Property
 The current model object instance active in the enumerator. The value is null if there are no more objects left.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObject Current { get; }
Public ReadOnly Property Current As ModelObject
	Get
Property Value
Type: ModelObject
See Also
Reference
ModelObjectEnumerator Class
Tekla.Structures.Model Namespace